//* Напиши скрипт управління формою логіна.

//* Обробка відправлення форми 'form.login-form' повинна відбуватися відповідно до події 'submit'
//* Під час відправлення форми сторінка не повинна перезавантажуватися.
//* Якщо у формі є незаповнені поля, виводь 'alert' з попередженням про те, що всі поля повинні бути заповнені.
//* Якщо користувач заповнив усі поля і відправив форму - збери значення полів в об'єкт, де ім'я поля буде ім'ям властивості,
//*    а значення поля - значенням властивості. Для доступу до елементів форми використовуй властивість 'elements'
//* Виведи об'єкт із введеними даними в консоль і очисти значення полів форми методом 'reset'

const form = document.querySelector(".login-form");

form.addEventListener("submit", formSubmit);

function formSubmit(evt) {
  evt.preventDefault(); //* Cкасовуємо перезавантаження сторінки (скасування дії браузера за замовчуванням)

  const emailInput = form.elements.email;
  const passwordInput = form.elements.password;

  //* Перевірка на незаповнені поля
  if (emailInput.value === "" || passwordInput.value === "") {
    alert("Всі поля повинні бути заповнені");
    return;
  }

  //* Створення об'єкту з введеними даними
  const data = {
    email: emailInput.value,
    password: passwordInput.value,
  };

  console.log(data); //* об'єкт із введеними даними

  form.reset(); //* Очищення полів форми
}
